Revit 2027 API
HorizontalCurveType Enumeration
 Represents the curve types for the horizontal curves which define Alignment geometry.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum HorizontalCurveType
Public Enumeration HorizontalCurveType
public enum class HorizontalCurveType
type HorizontalCurveType
Members
Member name | Value | Description
Arc | 2 |  Arc curve type.
Line | 1 |  Line curve type.
Spiral | 3 |  Spiral curve type.
Unknown | 0 |  Unknown curve type, used in cases where the curve type cannot be determined.
See Also
Reference
Autodesk.Revit.DB.Infrastructure Namespace